[
  "a",
  "accepts",
  "action",
  "active",
  "add",
  "after",
  "an",
  "and",
  "api",
  "app",
  "argparse",
  "array",
  "async",
  "attribute",
  "auth",
  "authentication",
  "autocomplete",
  "await",
  "awaits",
  "back",
  "badge",
  "bar",
  "before",
  "below",
  "block",
  "body",
  "border",
  "boundary",
  "box",
  "breakpoints",
  "build",
  "button",
  "calculator",
  "call",
  "callback",
  "calls",
  "card",
  "cards",
  "cart",
  "case",
  "catch",
  "category",
  "chart",
  "checkbox",
  "checking",
  "children",
  "class",
  "classname",
  "click",
  "closes",
  "code",
  "columns",
  "component",
  "components",
  "conditional",
  "confirm",
  "confirmation",
  "contact",
  "container",
  "context",
  "controlled",
  "cookie",
  "cors",
  "create",
  "crud",
  "css",
  "currency",
  "custom",
  "dark",
  "dashboard",
  "data",
  "date",
  "debounce",
  "decorator",
  "default",
  "delete",
  "dependency",
  "description",
  "detail",
  "dialog",
  "disabled",
  "display",
  "displays",
  "div",
  "dropdown",
  "edit",
  "effect",
  "element",
  "email",
  "endpoint",
  "environment",
  "error",
  "errors",
  "event",
  "exports",
  "express",
  "fastapi",
  "fetch",
  "fetches",
  "fetching",
  "field",
  "fields",
  "file",
  "filter",
  "filters",
  "flask",
  "flex",
  "flexbox",
  "focus",
  "footer",
  "for",
  "form",
  "format",
  "from",
  "function",
  "gap",
  "get",
  "grid",
  "group",
  "handler",
  "handles",
  "handling",
  "header",
  "headers",
  "helper",
  "hints",
  "hook",
  "hooks",
  "hover",
  "html",
  "icon",
  "icons",
  "image",
  "in",
  "index",
  "indicator",
  "init",
  "initial",
  "input",
  "inputs",
  "inside",
  "item",
  "items",
  "json",
  "key",
  "layout",
  "link",
  "links",
  "list",
  "loader",
  "loading",
  "loads",
  "local",
  "logic",
  "login",
  "logo",
  "logout",
  "main",
  "make",
  "management",
  "map",
  "maps",
  "margin",
  "max",
  "menu",
  "message",
  "messages",
  "methods",
  "middleware",
  "min",
  "mock",
  "mocks",
  "modal",
  "mode",
  "module",
  "mongodb",
  "more",
  "multi",
  "multiple",
  "name",
  "nav",
  "navbar",
  "navigation",
  "node",
  "notification",
  "object",
  "of",
  "on",
  "onchange",
  "onclick",
  "one",
  "onsubmit",
  "opens",
  "options",
  "overlay",
  "package",
  "padding",
  "page",
  "pagination",
  "params",
  "parse",
  "parses",
  "password",
  "picker",
  "placeholder",
  "post",
  "price",
  "product",
  "promise",
  "prop",
  "props",
  "provider",
  "pydantic",
  "python",
  "query",
  "radio",
  "range",
  "react",
  "reads",
  "receives",
  "redirect",
  "reducer",
  "ref",
  "remove",
  "render",
  "request",
  "required",
  "reset",
  "response",
  "responsive",
  "rest",
  "results",
  "retry",
  "returns",
  "route",
  "router",
  "routing",
  "row",
  "rules",
  "runs",
  "save",
  "schema",
  "script",
  "scroll",
  "search",
  "select",
  "selecting",
  "server",
  "service",
  "session",
  "set",
  "sidebar",
  "simple",
  "skeleton",
  "slider",
  "sortable",
  "sorts",
  "spinner",
  "sqlite",
  "state",
  "status",
  "step",
  "storage",
  "string",
  "style",
  "submenu",
  "submit",
  "submits",
  "success",
  "switch",
  "tab",
  "table",
  "tabs",
  "tailwind",
  "test",
  "tests",
  "text",
  "textarea",
  "that",
  "the",
  "theme",
  "three",
  "title",
  "to",
  "toast",
  "todo",
  "toggle",
  "toggles",
  "token",
  "two",
  "type",
  "typescript",
  "unit",
  "update",
  "upload",
  "url",
  "useeffect",
  "user",
  "useref",
  "users",
  "uses",
  "usestate",
  "utility",
  "validate",
  "validates",
  "validation",
  "validator",
  "value",
  "values",
  "variables",
  "variant",
  "view",
  "visibility",
  "vite",
  "while",
  "with",
  "write",
  "writes"
]